spec/fixtures/shopify/checkouts/default.yml

--- !ruby/object:ActiveResource::Collection
elements:
- !ruby/object:ShopifyAPI::Checkout
  attributes: !ruby/hash:ActiveSupport::HashWithIndifferentAccess
    id: 8345155783
    token: d1d6a5493771f98b433d3ba54c632d3b
    cart_token: 86dac211cd2620c0bffb8de958516499
    email: dino.maric@wizard.ba
    gateway: 
    buyer_accepts_marketing: false
    created_at: '2016-05-26T09:20:31-04:00'
    updated_at: '2016-05-26T09:31:47-04:00'
    landing_site: "/"
    note: 
    note_attributes: []
    referring_site: ''
    shipping_lines:
    - !ruby/object:ShopifyAPI::ShippingLine
      attributes: !ruby/hash:ActiveSupport::HashWithIndifferentAccess
        code: Standard Shipping
        price: '10.0'
        markup: '0.0'
        source: shopify
        title: Standard Shipping
        phone: 
        carrier_identifier: 
        tax_lines: []
        validation_context: 
        id: 356f620d23a77e60
      prefix_options: {}
      persisted: true
    subtotal_price: '0.00'
    taxes_included: true
    total_discounts: '0.00'
    total_line_items_price: '0.00'
    total_price: '10.00'
    total_tax: '0.00'
    total_weight: 0
    currency: BAM
    completed_at: 
    closed_at: 
    source_identifier: 
    source_url: 
    line_items:
    - !ruby/object:ShopifyAPI::LineItem
      attributes: !ruby/hash:ActiveSupport::HashWithIndifferentAccess
        applied_discounts: []
        key: cfe6dc21007ddacd
        compare_at_price: 
        destination_location_id: 1382856775
        fulfillment_service: manual
        gift_card: false
        grams: 0
        line_price: '0.00'
        origin_location_id: 1381846087
        price: '0.00'
        product_id: 6251029063
        properties: 
        quantity: 1
        requires_shipping: true
        sku: ''
        tax_lines: []
        taxable: true
        title: T shirt
        variant_id: 19929474695
        variant_title: ''
        vendor: Pow shop
      prefix_options: {}
      persisted: true
    name: "#8345155783"
    source: checkout_next
    discount_codes: []
    abandoned_checkout_url: https://checkout.shopify.com/12257608/checkouts/d1d6a5493771f98b433d3ba54c632d3b/recover?key=34b4a942f31cc74f8e5d53cd43d31f36
    tax_lines: []
    source_name: web
    shipping_address: !ruby/object:ShopifyAPI::ShippingAddress
      attributes: !ruby/hash:ActiveSupport::HashWithIndifferentAccess
        first_name: Dino
        address1: s
        phone: 
        city: Mostar
        zip: SA
        province: 
        country: Bosnia And Herzegovina
        last_name: mmm
        address2: ''
        company: 
        latitude: 
        longitude: 
        name: Dino mmm
        country_code: BA
        province_code: 
      prefix_options: {}
      persisted: true
    customer: !ruby/object:ShopifyAPI::Customer
      attributes: !ruby/hash:ActiveSupport::HashWithIndifferentAccess
        id: 3386577415
        email: dino.maric@wizard.ba
        accepts_marketing: false
        created_at: '2016-05-25T05:38:55-04:00'
        updated_at: '2016-05-26T09:23:32-04:00'
        first_name: Stevie Ray
        last_name: Vaughan
        orders_count: 2
        state: disabled
        total_spent: '0.00'
        last_order_id: 3200223495
        note: ''
        verified_email: true
        multipass_identifier: 
        tax_exempt: false
        tags: ''
        last_order_name: "#1003"
        default_address: !ruby/object:ShopifyAPI::Customer::DefaultAddress
          attributes: !ruby/hash:ActiveSupport::HashWithIndifferentAccess
            id: 3547382343
            first_name: Stevie Ray
            last_name: Vaughan
            company: ''
            address1: Mostar 55
            address2: ''
            city: Mostar
            province: HNK
            country: Bosnia And Herzegovina
            zip: '88000'
            phone: ''
            name: Stevie Ray Vaughan
            province_code: 
            country_code: BA
            country_name: Bosnia And Herzegovina
            default: true
          prefix_options: {}
          persisted: true
      prefix_options: {}
      persisted: true
  prefix_options: {}
  persisted: true
resource_class: !ruby/class 'ShopifyAPI::Checkout'
original_params:
  :limit: 250
  :page: 1
